load_test/results/20260420_194844/stress_vus20.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: async_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 3m30s max duration (incl. graceful stop):
              * stress: 20 looping VUs for 3m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 20 VUs  0m01.0s/3m0s

running (0m02.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 20 VUs  0m02.0s/3m0s

running (0m03.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 20 VUs  0m03.0s/3m0s

running (0m04.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   2% ] 20 VUs  0m04.0s/3m0s

running (0m05.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   3% ] 20 VUs  0m05.0s/3m0s

running (0m06.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   3% ] 20 VUs  0m06.0s/3m0s

running (0m07.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   4% ] 20 VUs  0m07.0s/3m0s

running (0m08.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   4% ] 20 VUs  0m08.0s/3m0s

running (0m09.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   5% ] 20 VUs  0m09.0s/3m0s

running (0m10.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   6% ] 20 VUs  0m10.0s/3m0s

running (0m11.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   6% ] 20 VUs  0m11.0s/3m0s

running (0m12.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   7% ] 20 VUs  0m12.0s/3m0s

running (0m13.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   7% ] 20 VUs  0m13.0s/3m0s

running (0m14.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   8% ] 20 VUs  0m14.0s/3m0s

running (0m15.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   8% ] 20 VUs  0m15.0s/3m0s

running (0m16.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   9% ] 20 VUs  0m16.0s/3m0s

running (0m17.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [   9% ] 20 VUs  0m17.0s/3m0s

running (0m18.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  10% ] 20 VUs  0m18.0s/3m0s

running (0m19.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  11% ] 20 VUs  0m19.0s/3m0s

running (0m20.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  11% ] 20 VUs  0m20.0s/3m0s

running (0m21.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  12% ] 20 VUs  0m21.0s/3m0s

running (0m22.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  12% ] 20 VUs  0m22.0s/3m0s

running (0m23.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  13% ] 20 VUs  0m23.0s/3m0s

running (0m24.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  13% ] 20 VUs  0m24.0s/3m0s

running (0m25.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  14% ] 20 VUs  0m25.0s/3m0s

running (0m26.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  14% ] 20 VUs  0m26.0s/3m0s

running (0m27.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  15% ] 20 VUs  0m27.0s/3m0s

running (0m28.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  16% ] 20 VUs  0m28.0s/3m0s

running (0m29.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  16% ] 20 VUs  0m29.0s/3m0s

running (0m30.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  17% ] 20 VUs  0m30.0s/3m0s

running (0m31.0s), 20/20 VUs, 1 complete and 0 interrupted iterations
stress   [  17% ] 20 VUs  0m31.0s/3m0s

running (0m32.0s), 20/20 VUs, 3 complete and 0 interrupted iterations
stress   [  18% ] 20 VUs  0m32.0s/3m0s

running (0m33.0s), 20/20 VUs, 3 complete and 0 interrupted iterations
stress   [  18% ] 20 VUs  0m33.0s/3m0s

running (0m34.0s), 20/20 VUs, 3 complete and 0 interrupted iterations
stress   [  19% ] 20 VUs  0m34.0s/3m0s

running (0m35.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  19% ] 20 VUs  0m35.0s/3m0s

running (0m36.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  20% ] 20 VUs  0m36.0s/3m0s

running (0m37.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  21% ] 20 VUs  0m37.0s/3m0s

running (0m38.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  21% ] 20 VUs  0m38.0s/3m0s

running (0m39.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  22% ] 20 VUs  0m39.0s/3m0s

running (0m40.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  22% ] 20 VUs  0m40.0s/3m0s

running (0m41.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  23% ] 20 VUs  0m41.0s/3m0s

running (0m42.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  23% ] 20 VUs  0m42.0s/3m0s

running (0m43.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  24% ] 20 VUs  0m43.0s/3m0s

running (0m44.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  24% ] 20 VUs  0m44.0s/3m0s

running (0m45.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  25% ] 20 VUs  0m45.0s/3m0s

running (0m46.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  26% ] 20 VUs  0m46.0s/3m0s

running (0m47.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  26% ] 20 VUs  0m47.0s/3m0s

running (0m48.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  27% ] 20 VUs  0m48.0s/3m0s

running (0m49.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  27% ] 20 VUs  0m49.0s/3m0s

running (0m50.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  28% ] 20 VUs  0m50.0s/3m0s

running (0m51.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  28% ] 20 VUs  0m51.0s/3m0s

running (0m52.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  29% ] 20 VUs  0m52.0s/3m0s

running (0m53.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  29% ] 20 VUs  0m53.0s/3m0s

running (0m54.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  30% ] 20 VUs  0m54.0s/3m0s

running (0m55.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  31% ] 20 VUs  0m55.0s/3m0s

running (0m56.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  31% ] 20 VUs  0m56.0s/3m0s

running (0m57.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  32% ] 20 VUs  0m57.0s/3m0s

running (0m58.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  32% ] 20 VUs  0m58.0s/3m0s

running (0m59.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  33% ] 20 VUs  0m59.0s/3m0s

running (1m00.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  33% ] 20 VUs  1m00.0s/3m0s

running (1m01.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  34% ] 20 VUs  1m01.0s/3m0s

running (1m02.0s), 20/20 VUs, 4 complete and 0 interrupted iterations
stress   [  34% ] 20 VUs  1m02.0s/3m0s

running (1m03.0s), 20/20 VUs, 5 complete and 0 interrupted iterations
stress   [  35% ] 20 VUs  1m03.0s/3m0s

running (1m04.0s), 20/20 VUs, 6 complete and 0 interrupted iterations
stress   [  36% ] 20 VUs  1m04.0s/3m0s

running (1m05.0s), 20/20 VUs, 6 complete and 0 interrupted iterations
stress   [  36% ] 20 VUs  1m05.0s/3m0s

running (1m06.0s), 20/20 VUs, 7 complete and 0 interrupted iterations
stress   [  37% ] 20 VUs  1m06.0s/3m0s

running (1m07.0s), 20/20 VUs, 8 complete and 0 interrupted iterations
stress   [  37% ] 20 VUs  1m07.0s/3m0s

running (1m08.0s), 20/20 VUs, 9 complete and 0 interrupted iterations
stress   [  38% ] 20 VUs  1m08.0s/3m0s

running (1m09.0s), 20/20 VUs, 9 complete and 0 interrupted iterations
stress   [  38% ] 20 VUs  1m09.0s/3m0s

running (1m10.0s), 20/20 VUs, 10 complete and 0 interrupted iterations
stress   [  39% ] 20 VUs  1m10.0s/3m0s

running (1m11.0s), 20/20 VUs, 11 complete and 0 interrupted iterations
stress   [  39% ] 20 VUs  1m11.0s/3m0s

running (1m12.0s), 20/20 VUs, 11 complete and 0 interrupted iterations
stress   [  40% ] 20 VUs  1m12.0s/3m0s

running (1m13.0s), 20/20 VUs, 12 complete and 0 interrupted iterations
stress   [  41% ] 20 VUs  1m13.0s/3m0s

running (1m14.0s), 20/20 VUs, 13 complete and 0 interrupted iterations
stress   [  41% ] 20 VUs  1m14.0s/3m0s

running (1m15.0s), 20/20 VUs, 13 complete and 0 interrupted iterations
stress   [  42% ] 20 VUs  1m15.0s/3m0s

running (1m16.0s), 20/20 VUs, 14 complete and 0 interrupted iterations
stress   [  42% ] 20 VUs  1m16.0s/3m0s

running (1m17.0s), 20/20 VUs, 15 complete and 0 interrupted iterations
stress   [  43% ] 20 VUs  1m17.0s/3m0s

running (1m18.0s), 20/20 VUs, 15 complete and 0 interrupted iterations
stress   [  43% ] 20 VUs  1m18.0s/3m0s

running (1m19.0s), 20/20 VUs, 16 complete and 0 interrupted iterations
stress   [  44% ] 20 VUs  1m19.0s/3m0s

running (1m20.0s), 20/20 VUs, 17 complete and 0 interrupted iterations
stress   [  44% ] 20 VUs  1m20.0s/3m0s

running (1m21.0s), 20/20 VUs, 18 complete and 0 interrupted iterations
stress   [  45% ] 20 VUs  1m21.0s/3m0s

running (1m22.0s), 20/20 VUs, 18 complete and 0 interrupted iterations
stress   [  46% ] 20 VUs  1m22.0s/3m0s

running (1m23.0s), 20/20 VUs, 19 complete and 0 interrupted iterations
stress   [  46% ] 20 VUs  1m23.0s/3m0s

running (1m24.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
stress   [  47% ] 20 VUs  1m24.0s/3m0s

running (1m25.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
stress   [  47% ] 20 VUs  1m25.0s/3m0s

running (1m26.0s), 20/20 VUs, 21 complete and 0 interrupted iterations
stress   [  48% ] 20 VUs  1m26.0s/3m0s

running (1m27.0s), 20/20 VUs, 22 complete and 0 interrupted iterations
stress   [  48% ] 20 VUs  1m27.0s/3m0s

running (1m28.0s), 20/20 VUs, 22 complete and 0 interrupted iterations
stress   [  49% ] 20 VUs  1m28.0s/3m0s

running (1m29.0s), 20/20 VUs, 23 complete and 0 interrupted iterations
stress   [  49% ] 20 VUs  1m29.0s/3m0s

running (1m30.0s), 20/20 VUs, 24 complete and 0 interrupted iterations
stress   [  50% ] 20 VUs  1m30.0s/3m0s

running (1m31.0s), 20/20 VUs, 25 complete and 0 interrupted iterations
stress   [  51% ] 20 VUs  1m31.0s/3m0s

running (1m32.0s), 20/20 VUs, 25 complete and 0 interrupted iterations
stress   [  51% ] 20 VUs  1m32.0s/3m0s

running (1m33.0s), 20/20 VUs, 26 complete and 0 interrupted iterations
stress   [  52% ] 20 VUs  1m33.0s/3m0s

running (1m34.0s), 20/20 VUs, 27 complete and 0 interrupted iterations
stress   [  52% ] 20 VUs  1m34.0s/3m0s

running (1m35.0s), 20/20 VUs, 27 complete and 0 interrupted iterations
stress   [  53% ] 20 VUs  1m35.0s/3m0s

running (1m36.0s), 20/20 VUs, 28 complete and 0 interrupted iterations
stress   [  53% ] 20 VUs  1m36.0s/3m0s

running (1m37.0s), 20/20 VUs, 29 complete and 0 interrupted iterations
stress   [  54% ] 20 VUs  1m37.0s/3m0s

running (1m38.0s), 20/20 VUs, 30 complete and 0 interrupted iterations
stress   [  54% ] 20 VUs  1m38.0s/3m0s

running (1m39.0s), 20/20 VUs, 30 complete and 0 interrupted iterations
stress   [  55% ] 20 VUs  1m39.0s/3m0s

running (1m40.0s), 20/20 VUs, 31 complete and 0 interrupted iterations
stress   [  56% ] 20 VUs  1m40.0s/3m0s

running (1m41.0s), 20/20 VUs, 32 complete and 0 interrupted iterations
stress   [  56% ] 20 VUs  1m41.0s/3m0s

running (1m42.0s), 20/20 VUs, 32 complete and 0 interrupted iterations
stress   [  57% ] 20 VUs  1m42.0s/3m0s

running (1m43.0s), 20/20 VUs, 33 complete and 0 interrupted iterations
stress   [  57% ] 20 VUs  1m43.0s/3m0s

running (1m44.0s), 20/20 VUs, 34 complete and 0 interrupted iterations
stress   [  58% ] 20 VUs  1m44.0s/3m0s

running (1m45.0s), 20/20 VUs, 34 complete and 0 interrupted iterations
stress   [  58% ] 20 VUs  1m45.0s/3m0s

running (1m46.0s), 20/20 VUs, 35 complete and 0 interrupted iterations
stress   [  59% ] 20 VUs  1m46.0s/3m0s

running (1m47.0s), 20/20 VUs, 36 complete and 0 interrupted iterations
stress   [  59% ] 20 VUs  1m47.0s/3m0s

running (1m48.0s), 20/20 VUs, 37 complete and 0 interrupted iterations
stress   [  60% ] 20 VUs  1m48.0s/3m0s

running (1m49.0s), 20/20 VUs, 37 complete and 0 interrupted iterations
stress   [  61% ] 20 VUs  1m49.0s/3m0s

running (1m50.0s), 20/20 VUs, 38 complete and 0 interrupted iterations
stress   [  61% ] 20 VUs  1m50.0s/3m0s

running (1m51.0s), 20/20 VUs, 39 complete and 0 interrupted iterations
stress   [  62% ] 20 VUs  1m51.0s/3m0s

running (1m52.0s), 20/20 VUs, 39 complete and 0 interrupted iterations
stress   [  62% ] 20 VUs  1m52.0s/3m0s

running (1m53.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
stress   [  63% ] 20 VUs  1m53.0s/3m0s

running (1m54.0s), 20/20 VUs, 41 complete and 0 interrupted iterations
stress   [  63% ] 20 VUs  1m54.0s/3m0s

running (1m55.0s), 20/20 VUs, 42 complete and 0 interrupted iterations
stress   [  64% ] 20 VUs  1m55.0s/3m0s

running (1m56.0s), 20/20 VUs, 42 complete and 0 interrupted iterations
stress   [  64% ] 20 VUs  1m56.0s/3m0s

running (1m57.0s), 20/20 VUs, 43 complete and 0 interrupted iterations
stress   [  65% ] 20 VUs  1m57.0s/3m0s

running (1m58.0s), 20/20 VUs, 44 complete and 0 interrupted iterations
stress   [  66% ] 20 VUs  1m58.0s/3m0s

running (1m59.0s), 20/20 VUs, 45 complete and 0 interrupted iterations
stress   [  66% ] 20 VUs  1m59.0s/3m0s

running (2m00.0s), 20/20 VUs, 46 complete and 0 interrupted iterations
stress   [  67% ] 20 VUs  2m00.0s/3m0s

running (2m01.0s), 20/20 VUs, 46 complete and 0 interrupted iterations
stress   [  67% ] 20 VUs  2m01.0s/3m0s

running (2m02.0s), 20/20 VUs, 47 complete and 0 interrupted iterations
stress   [  68% ] 20 VUs  2m02.0s/3m0s

running (2m03.0s), 20/20 VUs, 48 complete and 0 interrupted iterations
stress   [  68% ] 20 VUs  2m03.0s/3m0s

running (2m04.0s), 20/20 VUs, 49 complete and 0 interrupted iterations
stress   [  69% ] 20 VUs  2m04.0s/3m0s

running (2m05.0s), 20/20 VUs, 49 complete and 0 interrupted iterations
stress   [  69% ] 20 VUs  2m05.0s/3m0s

running (2m06.0s), 20/20 VUs, 50 complete and 0 interrupted iterations
stress   [  70% ] 20 VUs  2m06.0s/3m0s

running (2m07.0s), 20/20 VUs, 51 complete and 0 interrupted iterations
stress   [  71% ] 20 VUs  2m07.0s/3m0s

running (2m08.0s), 20/20 VUs, 52 complete and 0 interrupted iterations
stress   [  71% ] 20 VUs  2m08.0s/3m0s

running (2m09.0s), 20/20 VUs, 52 complete and 0 interrupted iterations
stress   [  72% ] 20 VUs  2m09.0s/3m0s

running (2m10.0s), 20/20 VUs, 53 complete and 0 interrupted iterations
stress   [  72% ] 20 VUs  2m10.0s/3m0s

running (2m11.0s), 20/20 VUs, 54 complete and 0 interrupted iterations
stress   [  73% ] 20 VUs  2m11.0s/3m0s

running (2m12.0s), 20/20 VUs, 55 complete and 0 interrupted iterations
stress   [  73% ] 20 VUs  2m12.0s/3m0s

running (2m13.0s), 20/20 VUs, 55 complete and 0 interrupted iterations
stress   [  74% ] 20 VUs  2m13.0s/3m0s

running (2m14.0s), 20/20 VUs, 56 complete and 0 interrupted iterations
stress   [  74% ] 20 VUs  2m14.0s/3m0s

running (2m15.0s), 20/20 VUs, 57 complete and 0 interrupted iterations
stress   [  75% ] 20 VUs  2m15.0s/3m0s

running (2m16.0s), 20/20 VUs, 58 complete and 0 interrupted iterations
stress   [  76% ] 20 VUs  2m16.0s/3m0s

running (2m17.0s), 20/20 VUs, 58 complete and 0 interrupted iterations
stress   [  76% ] 20 VUs  2m17.0s/3m0s

running (2m18.0s), 20/20 VUs, 59 complete and 0 interrupted iterations
stress   [  77% ] 20 VUs  2m18.0s/3m0s

running (2m19.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
stress   [  77% ] 20 VUs  2m19.0s/3m0s

running (2m20.0s), 20/20 VUs, 61 complete and 0 interrupted iterations
stress   [  78% ] 20 VUs  2m20.0s/3m0s

running (2m21.0s), 20/20 VUs, 61 complete and 0 interrupted iterations
stress   [  78% ] 20 VUs  2m21.0s/3m0s

running (2m22.0s), 20/20 VUs, 62 complete and 0 interrupted iterations
stress   [  79% ] 20 VUs  2m22.0s/3m0s

running (2m23.0s), 20/20 VUs, 63 complete and 0 interrupted iterations
stress   [  79% ] 20 VUs  2m23.0s/3m0s

running (2m24.0s), 20/20 VUs, 64 complete and 0 interrupted iterations
stress   [  80% ] 20 VUs  2m24.0s/3m0s

running (2m25.0s), 20/20 VUs, 64 complete and 0 interrupted iterations
stress   [  81% ] 20 VUs  2m25.0s/3m0s

running (2m26.0s), 20/20 VUs, 65 complete and 0 interrupted iterations
stress   [  81% ] 20 VUs  2m26.0s/3m0s

running (2m27.0s), 20/20 VUs, 66 complete and 0 interrupted iterations
stress   [  82% ] 20 VUs  2m27.0s/3m0s

running (2m28.0s), 20/20 VUs, 67 complete and 0 interrupted iterations
stress   [  82% ] 20 VUs  2m28.0s/3m0s

running (2m29.0s), 20/20 VUs, 67 complete and 0 interrupted iterations
stress   [  83% ] 20 VUs  2m29.0s/3m0s

running (2m30.0s), 20/20 VUs, 68 complete and 0 interrupted iterations
stress   [  83% ] 20 VUs  2m30.0s/3m0s

running (2m31.0s), 20/20 VUs, 69 complete and 0 interrupted iterations
stress   [  84% ] 20 VUs  2m31.0s/3m0s

running (2m32.0s), 20/20 VUs, 69 complete and 0 interrupted iterations
stress   [  84% ] 20 VUs  2m32.0s/3m0s

running (2m33.0s), 20/20 VUs, 70 complete and 0 interrupted iterations
stress   [  85% ] 20 VUs  2m33.0s/3m0s

running (2m34.0s), 20/20 VUs, 71 complete and 0 interrupted iterations
stress   [  86% ] 20 VUs  2m34.0s/3m0s

running (2m35.0s), 20/20 VUs, 72 complete and 0 interrupted iterations
stress   [  86% ] 20 VUs  2m35.0s/3m0s

running (2m36.0s), 20/20 VUs, 72 complete and 0 interrupted iterations
stress   [  87% ] 20 VUs  2m36.0s/3m0s

running (2m37.0s), 20/20 VUs, 73 complete and 0 interrupted iterations
stress   [  87% ] 20 VUs  2m37.0s/3m0s

running (2m38.0s), 20/20 VUs, 74 complete and 0 interrupted iterations
stress   [  88% ] 20 VUs  2m38.0s/3m0s

running (2m39.0s), 20/20 VUs, 74 complete and 0 interrupted iterations
stress   [  88% ] 20 VUs  2m39.0s/3m0s

running (2m40.0s), 20/20 VUs, 75 complete and 0 interrupted iterations
stress   [  89% ] 20 VUs  2m40.0s/3m0s

running (2m41.0s), 20/20 VUs, 76 complete and 0 interrupted iterations
stress   [  89% ] 20 VUs  2m41.0s/3m0s

running (2m42.0s), 20/20 VUs, 77 complete and 0 interrupted iterations
stress   [  90% ] 20 VUs  2m42.0s/3m0s

running (2m43.0s), 20/20 VUs, 77 complete and 0 interrupted iterations
stress   [  91% ] 20 VUs  2m43.0s/3m0s

running (2m44.0s), 20/20 VUs, 78 complete and 0 interrupted iterations
stress   [  91% ] 20 VUs  2m44.0s/3m0s

running (2m45.0s), 20/20 VUs, 79 complete and 0 interrupted iterations
stress   [  92% ] 20 VUs  2m45.0s/3m0s

running (2m46.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
stress   [  92% ] 20 VUs  2m46.0s/3m0s

running (2m47.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
stress   [  93% ] 20 VUs  2m47.0s/3m0s

running (2m48.0s), 20/20 VUs, 81 complete and 0 interrupted iterations
stress   [  93% ] 20 VUs  2m48.0s/3m0s

running (2m49.0s), 20/20 VUs, 82 complete and 0 interrupted iterations
stress   [  94% ] 20 VUs  2m49.0s/3m0s

running (2m50.0s), 20/20 VUs, 83 complete and 0 interrupted iterations
stress   [  94% ] 20 VUs  2m50.0s/3m0s

running (2m51.0s), 20/20 VUs, 84 complete and 0 interrupted iterations
stress   [  95% ] 20 VUs  2m51.0s/3m0s

running (2m52.0s), 20/20 VUs, 84 complete and 0 interrupted iterations
stress   [  96% ] 20 VUs  2m52.0s/3m0s

running (2m53.0s), 20/20 VUs, 85 complete and 0 interrupted iterations
stress   [  96% ] 20 VUs  2m53.0s/3m0s

running (2m54.0s), 20/20 VUs, 85 complete and 0 interrupted iterations
stress   [  97% ] 20 VUs  2m54.0s/3m0s

running (2m55.0s), 20/20 VUs, 86 complete and 0 interrupted iterations
stress   [  97% ] 20 VUs  2m55.0s/3m0s

running (2m56.0s), 20/20 VUs, 87 complete and 0 interrupted iterations
stress   [  98% ] 20 VUs  2m56.0s/3m0s

running (2m57.0s), 20/20 VUs, 88 complete and 0 interrupted iterations
stress   [  98% ] 20 VUs  2m57.0s/3m0s

running (2m58.0s), 20/20 VUs, 89 complete and 0 interrupted iterations
stress   [  99% ] 20 VUs  2m58.0s/3m0s

running (2m59.0s), 20/20 VUs, 89 complete and 0 interrupted iterations
stress   [  99% ] 20 VUs  2m59.0s/3m0s

running (3m00.0s), 20/20 VUs, 90 complete and 0 interrupted iterations
stress   [ 100% ] 20 VUs  3m00.0s/3m0s

running (3m01.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m02.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m03.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m04.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m05.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m06.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m07.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m08.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m09.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m10.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m11.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m12.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m13.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m14.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m15.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m16.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m17.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m18.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m19.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m20.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m21.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m22.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m23.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m24.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m25.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m26.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m27.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m28.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m29.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s

running (3m30.0s), 19/20 VUs, 91 complete and 0 interrupted iterations
stress ↓ [ 100% ] 20 VUs  3m0s


  █ THRESHOLDS 

    checks
    ✗ 'rate>0.95' rate=33.75%

    http_req_failed
    ✓ 'rate<0.2' rate=6.71%

    indexing_ready_rate
    ✓ 'rate>0.8' rate=100.00%

    upload_accepted_rate
    ✓ 'rate>0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 160    0.761817/s
    checks_succeeded...: 33.75% 54 out of 160
    checks_failed......: 66.25% 106 out of 160

    ✗ login success
      ↳  17% — ✓ 19 / ✗ 91
    ✗ documents success
      ↳  21% — ✓ 4 / ✗ 15
    ✓ upload accepted

    CUSTOM
    indexing_ready_rate............: 100.00% 12 out of 12
    indexing_wait_ms...............: avg=91847.916667 min=70911 med=78312.5 max=145809 p(90)=137994.6 p(95)=141621.3
    upload_accepted_rate...........: 100.00% 31 out of 31

    HTTP
    http_req_duration..............: avg=812.76ms     min=5ms   med=19.98ms max=30.79s p(90)=102.8ms  p(95)=431.62ms
      { expected_response:true }...: avg=462.46ms     min=5ms   med=19.08ms max=30.79s p(90)=46.84ms  p(95)=68.52ms 
    http_req_failed................: 6.71%   106 out of 1578
    http_reqs......................: 1578    7.513425/s

    EXECUTION
    iteration_duration.............: avg=2.66s        min=1.24s med=1.31s   max=31.19s p(90)=1.62s    p(95)=2.43s   
    iterations.....................: 91      0.433284/s
    vus............................: 19      min=19          max=20
    vus_max........................: 20      min=20          max=20

    NETWORK
    data_received..................: 489 kB  2.3 kB/s
    data_sent......................: 6.3 MB  30 kB/s



running (3m30.0s), 00/20 VUs, 91 complete and 19 interrupted iterations
stress ✓ [ 100% ] 20 VUs  3m0s